SehatqProject/app/controllers/home_controller.rb

SELECT `users`.* FROM `users`
---
    def index
        @user = User.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    def show
        @user = User.find_by_id(params[:id])